

-- ЧТО БЫ НЕ ФОРМИРОВАТЬ БАЗУ ДАННЫХ И НЕ БЫЛЛО ЛИШНИХ 400+ СТРОК Я ОСТАВИЛ ТОЛЬКО ТЕКСТ КОДА ПО ДЗ.
-- ПРОБЛЕМ ДОАВИТЬ СТОБЕЦ ИЛИ СГЕНЕРИРОВАТЬ ДАННЫЕ У МЕНЯ НЕТ. 
-- ТОЛЬКО РЕШЕНИЕ ДЗ

use VK;


-- Написать скрипт, возвращающий список имен (только firstname) пользователей без повторений 
-- в алфавитном порядке 
SELECT DISTINCT FIRSTNAME
from USERS;

-- Написать скрипт, отмечающий несовершеннолетних пользователей как неактивных 
-- (поле is_active = true). 
-- При необходимости предварительно добавить такое поле в таблицу profiles со значением 
-- по умолчанию = false (или 0)

UPDATE PROFILES 
set IS_ACTIVE = 1
WHERE BIRTHDAY < (CURRENT_DATE - INTERVAL 18 YEAR);

-- Написать скрипт, удаляющий сообщения «из будущего» (дата позже сегодняшней)
DELETE FROM MESSAGES
WHERE CREATED_AT > CURRENT_DATE;

